---
kind: method
id: M:Autodesk.Revit.Attributes.JournalingAttribute.#ctor(Autodesk.Revit.Attributes.JournalingMode)
source: html/fa2449b5-3ac8-1f8a-fc06-0ee65be56279.htm
---
# Autodesk.Revit.Attributes.JournalingAttribute.#ctor Method

Constructs a new JournalingAttribute.

## Syntax (C#)
```csharp
public JournalingAttribute(
	JournalingMode mode
)
```

## Parameters
- **mode** (`Autodesk.Revit.Attributes.JournalingMode`)